# 02 - Einführung Pandas DataFrame
Um die Pandas Bibliothek benutzen zu können müssen wir diese erst importieren. Dies machen wir indem wir die Bibliothek mit dem Namen **Pandas als Modul** importieren. <!-- Hinweis: Das Modul muss installiert sein -->

**Module** sind ein wichtiges Element in Python. In Modulen sind zahlreiche Funktionen gebündelt, so dass wir diese auf einfache Art und Weise benutzen können. Dafür müssen wir diese im ersten Schritt Importieren.

## Import der Pandas Bibliothek

In [3]:
# immer alle import statements in einer zelle einfügen. Vor dieser Zelle sollte kein Code stehen.
import pandas as pd

## Einlesen einer CSV-Datei
Einlesen eines CSVs mit `pd.read_csv()`

In [5]:
# anzeigen des ergebnisses ohne den Dataframe in einer Variable zu speichern
pd.read_csv('../src/beispiele/02_kunden.csv', sep=',')

  first_name  last_name                           email  gender
0   Oliviero  Longforth           olongforth0@wikia.com    Male
1    Curtice   Hallgate             challgate1@gmpg.org    Male
2       Darb     Evreux          devreux2@hostgator.com    Male
3        Ely    Themann            ethemann3@hao123.com    Male
4     Kaylyn      Brady                   kbrady4@51.la  Female
5  Sebastien   Rosevear              srosevear5@who.int    Male
6     Janela  Lanchbury  jlanchbury6@barnesandnoble.com  Female
7    Nicolle    Inkster           ninkster7@youtube.com  Female

In [6]:
# speichern in einer variablen
df_kunden = pd.read_csv('../src/beispiele/02_kunden.csv', sep=',')

In [7]:
# damit es sichtbar wird, geben lassen wir uns den wert der variable anzeigen
df_kunden = pd.read_csv('../src/beispiele/02_kunden.csv', sep=',')
df_kunden

  first_name  last_name                           email  gender
0   Oliviero  Longforth           olongforth0@wikia.com    Male
1    Curtice   Hallgate             challgate1@gmpg.org    Male
2       Darb     Evreux          devreux2@hostgator.com    Male
3        Ely    Themann            ethemann3@hao123.com    Male
4     Kaylyn      Brady                   kbrady4@51.la  Female
5  Sebastien   Rosevear              srosevear5@who.int    Male
6     Janela  Lanchbury  jlanchbury6@barnesandnoble.com  Female
7    Nicolle    Inkster           ninkster7@youtube.com  Female

## Sich eine Übersicht verschaffen

In [8]:
# head gibt uns die ersten 5 Zeilen des Dataframes
df_kunden.head()

  first_name  last_name                   email  gender
0   Oliviero  Longforth   olongforth0@wikia.com    Male
1    Curtice   Hallgate     challgate1@gmpg.org    Male
2       Darb     Evreux  devreux2@hostgator.com    Male
3        Ely    Themann    ethemann3@hao123.com    Male
4     Kaylyn      Brady           kbrady4@51.la  Female

In [9]:
# tail gibt uns die letzten 5 Zeilen des Dataframes
df_kunden.tail()

  first_name  last_name                           email  gender
3        Ely    Themann            ethemann3@hao123.com    Male
4     Kaylyn      Brady                   kbrady4@51.la  Female
5  Sebastien   Rosevear              srosevear5@who.int    Male
6     Janela  Lanchbury  jlanchbury6@barnesandnoble.com  Female
7    Nicolle    Inkster           ninkster7@youtube.com  Female

In [10]:
df_kunden.sample(3)

  first_name  last_name                           email  gender
6     Janela  Lanchbury  jlanchbury6@barnesandnoble.com  Female
2       Darb     Evreux          devreux2@hostgator.com    Male
3        Ely    Themann            ethemann3@hao123.com    Male

In [11]:
# Länge des DataFrames
len(df_kunden)

8

In [13]:
df_kunden.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
first_name    8 non-null object
last_name     8 non-null object
email         8 non-null object
gender        8 non-null object
dtypes: object(4)
memory usage: 336.0+ bytes

# Spalten und Zeilen betrachten

In [23]:
# Nur die Spaltenwerte

In [28]:
df_kunden.head()

  first_name  last_name                   email  gender
0   Oliviero  Longforth   olongforth0@wikia.com    Male
1    Curtice   Hallgate     challgate1@gmpg.org    Male
2       Darb     Evreux  devreux2@hostgator.com    Male
3        Ely    Themann    ethemann3@hao123.com    Male
4     Kaylyn      Brady           kbrady4@51.la  Female

In [29]:
# Spalte auslesen
df_kunden['first_name']

0     Oliviero
1      Curtice
2         Darb
3          Ely
4       Kaylyn
5    Sebastien
6       Janela
7      Nicolle
Name: first_name, dtype: object

In [30]:
# Andere Spalte wählen
df_kunden['last_name']

0    Longforth
1     Hallgate
2       Evreux
3      Themann
4        Brady
5     Rosevear
6    Lanchbury
7      Inkster
Name: last_name, dtype: object

In [31]:
# Zeile auslesen
df_kunden.loc[4]

first_name           Kaylyn
last_name             Brady
email         kbrady4@51.la
gender               Female
Name: 4, dtype: object

# Mit Spalten arbeiten

In [35]:
df_kunden['gender']

0      Male
1      Male
2      Male
3      Male
4    Female
5      Male
6    Female
7    Female
Name: gender, dtype: object

In [34]:
df_kunden['gender'].value_counts()

Male      5
Female    3
Name: gender, dtype: int64

# Mehrer Spalten oder Zeilen über den Namen auswählen

In [41]:
df_kunden

  first_name  last_name                           email  gender
0   Oliviero  Longforth           olongforth0@wikia.com    Male
1    Curtice   Hallgate             challgate1@gmpg.org    Male
2       Darb     Evreux          devreux2@hostgator.com    Male
3        Ely    Themann            ethemann3@hao123.com    Male
4     Kaylyn      Brady                   kbrady4@51.la  Female
5  Sebastien   Rosevear              srosevear5@who.int    Male
6     Janela  Lanchbury  jlanchbury6@barnesandnoble.com  Female
7    Nicolle    Inkster           ninkster7@youtube.com  Female

In [37]:
df_kunden[['first_name', 'gender']]

  first_name  gender
0   Oliviero    Male
1    Curtice    Male
2       Darb    Male
3        Ely    Male
4     Kaylyn  Female
5  Sebastien    Male
6     Janela  Female
7    Nicolle  Female

In [38]:
df_kunden.loc[[0,2,4]]

  first_name  last_name                   email  gender
0   Oliviero  Longforth   olongforth0@wikia.com    Male
2       Darb     Evreux  devreux2@hostgator.com    Male
4     Kaylyn      Brady           kbrady4@51.la  Female

In [39]:
df_kunden.loc[[0,2,4]]['gender']

0      Male
2      Male
4    Female
Name: gender, dtype: object

In [43]:
df_kunden.loc[[0,2,4]][['first_name', 'gender']]

  first_name  gender
0   Oliviero    Male
2       Darb    Male
4     Kaylyn  Female

In [44]:
df_select = df_kunden.loc[[0,2,4]]
df_select

  first_name  last_name                   email  gender
0   Oliviero  Longforth   olongforth0@wikia.com    Male
2       Darb     Evreux  devreux2@hostgator.com    Male
4     Kaylyn      Brady           kbrady4@51.la  Female

In [45]:
df_select = df_kunden.loc[[0,2,4]]
df_select[['first_name', 'gender']]

  first_name  gender
0   Oliviero    Male
2       Darb    Male
4     Kaylyn  Female

# Tipps und Tricks
Übersicht aller Datentypen: https://docs.scipy.org/doc/numpy/user/basics.types.html